# -----------------------------------------------------------------------
# Gráfica en Python con SymPy
# -----------------------------------------------------------------------
# Importar el módulo SymPy
# Funciones:
# y=x
# y=2x
# y=3x
# -----------------------------------------------------------------------
import sympy as sym
from sympy import symbols
from sympy.plotting import plot
f1 = "x"
f2 = "2*x"
f3 = "3*x"
x = symbols('x')
plot(f1, f2, f3, (x, 0, 5))
# -----------------------------------------------------------------------
